{
  "culture": [
    {
      "type": "post",
      "author": "Princess_Yoloswag",
      "text": "I'll start. \n\n**NomNom Chicken** (Doura)\n\nKorean fried chicken place that only opened recently. Very tasty and authentic. Get the Spicy (=authentic), Soy Garlic, or mild version (if you can't handle spice). Kimchi is also great. Super nice people too.\n\n&amp;nbsp;\n\n**New Indo Lankan Restaurant** (Doura)\n\nI know the place is authentic because I've been there over a dozen times and have yet to encounter someone who's Lebanese that I didn't drag there myself. The place is small, not very inviting, smells of oil, and the waiter barely speaks English or Arabic. The food is also amazing, authentic and very flavorful. If you value ambience over food, stay away, but if you want proper South Asian cuisine, you are in the right spot. My western and more adventurous Lebanese friends love that place. \n\n(On a more personal note: I love having first dates there and seeing how she reacts. If she thinks it's hilarious and curious about the food, she's a keeper.)\n\n&amp;nbsp;\n\n**Alsah restaurant** (Furn el Chebek)  \nTiny place near Hawa Chicken. Probably my favorite place for authentic Lebanese food. All my Lebanese friends also confirm it's authenticity. If I feel like having Lebanese food, that's my #1 spot.",
      "activityTypes": [
        "culture",
        "food"
      ],
      "popularity": 13,
      "url": "https://www.reddit.com/r/lebanon/comments/1ixb9cf/favorite_hidden_gem_restaurants/"
    },
    {
      "type": "post",
      "author": "MethodGlobal1994",
      "text": "\nLebanon has been always on my top list and honestly i can’t even imagine I’m going there soon. You guys are truly magical and you truly deserve all the best. Sorry if it’s long a little bit but I’m a freak when it comes to explore a new culture especially one that rich as yours. Im so sorry if this is too long and too much completely understandable \n\nThis is a overview of what i like \n\n\t•\tHistory &amp; old cities (ancient ruins, castles, mosques, old ports, alleys)\n\n\t•\tBeautiful nature escapes that are not too far\n\n\t•\tMountains and viewpoints\n\n\t•\tHidden gems / authentic neighborhoods\n\n\t•\tWalkable areas with culture and character\n\nMy limits\n\t•\tI’m staying in Beirut, and I’m only willing to \ngo up to 1 hour away.\n\n\t•\tThe only longer trip I’m doing is Byblos (I’m definitely going there — love the vibe).\n\nPlaces I’m considering\n\n\t•\tJeita Grotto (looks amazing — worth it?)\n\n\t•\tHarissa + Jounieh\n\n\t•\tBeirut historical areas / alleys\n\n\t•\tShouf or any mountain spots within 1 hour\n\n\n\n\tWhat are the absolute must-visit places for someone who loves history, nature, and hidden old streets, what’s the best food places that are authentic, any hidden gems you’d recommend \n\nWould appreciate any local tips, secret spots\n\nThank you guys \n",
      "activityTypes": [
        "culture",
        "nature"
      ],
      "popularity": 4,
      "url": "https://www.reddit.com/r/lebanon/comments/1p1f81r/im_visiting_soon_for_7_days_and_id_love/"
    },
    {
      "type": "comment",
      "author": "Lbspirit",
      "text": "Places to try beirut:\n\n-ahwet 60 beirut recommend it \n- brio coffeeshop recommend it \n- cafe younis I like hamra branch \n- manara palace cafe recommend it \n- shatila cafe recommend it \n- on board bliss \n- malak al tawouk I recommend burgers \n- t-marbouta for lebanese cuisine \n- em nazih for lebanese cuisine \n- national museum \n-aub museum+tour in aub\n-usj museum \n- sursock palace \n- the art house \n- historical mosques of Beirut downtown\n- downtown beirut \n-zaytuna bay \n- mano shawarma burj Hammoud\n- a museum under a church in downtown\n- ɓarbar for sure recommended\n- sweets there's this called mufataka it's a beiruty traditional sweets gotta try it from a place called makary basta area\n- for sure the rawshe rock \n- bayrock on sunset just sit on the terrace amazing view \nAnd sure you can go out of beirut and explore places \n\nThese came to mind if I remembered more will let you know. And if you need anything don't hesitate really ask whatever you want. I live in beirut btw so if you need anything let me know.",
      "activityTypes": [
        "culture",
        "food",
        "nature"
      ],
      "popularity": 3,
      "url": "https://www.reddit.com/r/lebanon/comments/1p1f81r/im_visiting_soon_for_7_days_and_id_love/npqom8e/"
    },
    {
      "type": "comment",
      "author": "janeroe9",
      "text": "I would add to this list Jai in Clemenceau if you like Asian food. Also Salon Beirut in Clemeneau/Hamra either for brunch or on a Wednesday night for a Jazz night (a bit expensive). Levant coffeeshop in Gemmayze for some Arabic sweets with your coffee. Le Beirut or Mezyan in Hamra on a Thursday or Friday night for some loud Arabic music with good Lebanese food and arak. Beit Beirut museum in Sodeco for a tour down history lane. From the national museum walk to Badaro street and chill in any coffeeshop you like. \nAs for outside Beirut, Harissa is great choice. There is a trail called Darb el Qamar there that’s just lovely to hike.\nHave fun!\nRegarding the safety, it has been okay, yet no one knows when shit hits the fan.",
      "activityTypes": [
        "culture",
        "food",
        "nature"
      ],
      "popularity": 1,
      "url": "https://www.reddit.com/r/lebanon/comments/1p1f81r/im_visiting_soon_for_7_days_and_id_love/npsyxh0/"
    },
    {
      "type": "comment",
      "author": "phoolip",
      "text": "Ruins and old sites, must see baalbek. A little bit of a drive but well worth it. While there , u certainly want to visit zahlee, charming little town;  go have lunch at the Berdawni, restaurant Arabi.",
      "activityTypes": [
        "culture",
        "food"
      ],
      "popularity": 2,
      "url": "https://www.reddit.com/r/lebanon/comments/1p1f81r/im_visiting_soon_for_7_days_and_id_love/npr6jrx/"
    },
    {
      "type": "post",
      "author": "EreshkigalKish2",
      "text": "Description\n\nWeekend in Yammouneh, Lebanon’s Oldest Nature Reserve اليمّونة، أقدم محمية طبيعية بلبنان\n\nJuniper Scent عطر اللزّاب\n12\nLikes\n83\nViews\nSep 29\n2025\nHow to Spend a Weekend in Yammouneh\nEscape to Yammouneh, a hidden gem in Lebanon’s Bekaa. Start your morning with a traditional saj breakfast prepared by the warm locals, then head out to explore the breathtaking area , one of the world’s oldest protected areas, dating back to the Roman era. Wander through trails lined with majestic juniper trees , discover natural springs (there are nearly 80!), and visit the unique nursery that cultivates native plants and aromatic herbs.\n\nIn the heart of the village, don’t miss Our Lady of Yammouneh Church, a symbol of coexistence standing tall for centuries. By night, experience the magic of “Bayt el Arzal,” where you can sleep in a rustic wooden hut beneath thousand-year-old larch trees, under a sky lit with a million stars.\n\nWhether you’re into history, nature, or simply seeking peace, Yammouneh offers a weekend you’ll never forget.",
      "activityTypes": [
        "culture",
        "food",
        "nature"
      ],
      "popularity": 11,
      "url": "https://www.reddit.com/r/lebanon/comments/1ntodrm/weekend_in_yammouneh_lebanons_oldest_nature/"
    },
    {
      "type": "post",
      "author": "EreshkigalKish2",
      "text": "The MiM Museum - A Beirut Hidden Gem\n\nThe Titans Podcast\n32\nLikes\n1,072\nViews\nJul 19\n2024\n#Beirut\n\n\n#Business\n\n\n#Tech\n\n\nEver wondered how a successful entrepreneur spends their free time? In this exclusive interview, we meet Salim Eddé, the visionary entrepreneur behind the MIM Museum in Beirut, Lebanon.\n\n Mr. Edde's interests lie elsewhere entirely. Upon achieving financial independence and business success, he discovered a deep passion for minerals. \n\nEmbark on a guided tour through the museum's awe-inspiring collection of over 2,000 minerals, representing 450 unique species from 70 countries around the globe. Mr. Eddé himself will lead you on this journey, offering fascinating insights into the history and composition of these breathtaking natural wonders. If you're ever wondering what to do in #Beirut  the MiM Museum is one the sites you shouldn't miss. ",
      "activityTypes": [
        "culture",
        "food"
      ],
      "popularity": 12,
      "url": "https://www.reddit.com/r/lebanon/comments/1jrxj7m/the_mim_museum_a_beirut_hidden_gem/"
    },
    {
      "type": "comment",
      "author": "Sr_nygma",
      "text": "Sidenote here: since you are considering such a relatively long stay for our small county, you could relatively fit in 3-4 day trips and cover the entirety of the country during your stay, might i suggest:\n\n- a day at the beach north + visiting batrun and byblos ancient cities\n-a day at beit al din, deir al quamar, and the chouf reserve (could be also done in 1/2 a day)\n-a day in beqaa for the roman ruins in baalbek (can also become 1/2 a day if you leave early)\n-a day down in tyr with beach, historic city and all\n-if you're in for a long day (leave early, come back late, anda 2.5 hour drive each way) or an overnight you can also cover ehden and the cedar of god reserve",
      "activityTypes": [
        "culture",
        "nature"
      ],
      "popularity": 5,
      "url": "https://www.reddit.com/r/lebanon/comments/nbxiih/hey_planning_on_a_visiting_broummanabeirut_from/gy2qnyl/"
    },
    {
      "type": "comment",
      "author": "Terewawa",
      "text": "Why come all the way from the US to visit Brumana? Its kinda nice but meh. Visit other cities (tripoli, saïda), roman ruins in baalbeck, enjoy hiking, etc.",
      "activityTypes": [
        "culture"
      ],
      "popularity": 2,
      "url": "https://www.reddit.com/r/lebanon/comments/nbxiih/hey_planning_on_a_visiting_broummanabeirut_from/gy2y6j7/"
    },
    {
      "type": "comment",
      "author": "Sr_nygma",
      "text": "Hey, here are a few tips about Beirut:\n\nA walk to the Downtown area, Nejme square, as well as Beirut souks is a good option.\n\nSouk el Akel (food market) is happening there (Beirut Souks) on Tuesdays and Thrisdays evenings, and there is the farmer's market (souk al tayyeb) on Saturday morning.\n\nMuseums are a safe bet too, try the Sursok Museum (free) and the MIM (Minerals Museum, with a minimal fee) in Beirut, and you can always check, the National Museum, Dar el Nimr, Sfeir-Selmer Gallery or Beit Beirut (depending on the exhibition and if it is open).\n\nFancy some Manouche (traditional breakfast pie), Look up the Lebanese Bakery (Achrafieh) - a cosy place that brings incredible twists to the dish.\n\nFeel like having affordable and delicious Lebanese Mezze in the city? Look for T-marbouta (Hamra) &amp; Em Nazih (Hamra or Saifi).\n\nPrefer something Armenian? Then look up Nour-Fine Armenian Cuisine  (Abdel Wahab)\n\nFor busy nightlife, try Mar Mikhael (Armenia Street) any night. Something more chill would be Badaro district.\n\nAnd finally, for the best Lebanese ice cream of your life look up Hanna Mitri (halwayat al salam) - not the fanciest shop, but don't let that fool you (closed on Sunday).\n\nHope you have a good time.",
      "activityTypes": [
        "culture",
        "food",
        "nature"
      ],
      "popularity": 6,
      "url": "https://www.reddit.com/r/lebanon/comments/d8dfr9/im_coming_to_explore_lebanon_this_week/f1blnxa/"
    },
    {
      "type": "post",
      "author": "Kartuce",
      "text": "...where are the best places to eat AND drink (never the one without the other) for a full day (e.g. can be one suggestion for lunch place and another for dinner... akid eza fi shi ma7al 7elo not to miss, feel free to drop) ?\n\nAre there more or less hidden archeological gems (old churches, mosques, phoenician landmark from different eras) apart from the ones in Tyre and Sidon ?\n\nFeel free to add your personal recos or favourite things to do South or places to stay because : 1) I love good lebanese stories, 2) Your story might inspire me as my plan is pretty flexible",
      "activityTypes": [
        "culture",
        "food"
      ],
      "popularity": 24,
      "url": "https://www.reddit.com/r/lebanon/comments/ane2d5/daughters_and_sons_of_south_of_lebanon/"
    },
    {
      "type": "comment",
      "author": "NotValkyrie",
      "text": "the war Museum in Mleta and the Beaufort Castle (Chkif), the wazene river and restaurants around it are worth a visit (it's next to borders) i'm not sure if you'll find a high class place tho",
      "activityTypes": [
        "culture",
        "food"
      ],
      "popularity": 7,
      "url": "https://www.reddit.com/r/lebanon/comments/ane2d5/daughters_and_sons_of_south_of_lebanon/efsvlmr/"
    },
    {
      "type": "comment",
      "author": "[deleted]",
      "text": "Sour, definitely, unlike Saida, there's places to sit and drink in, and our seafood is second to none, same with our foul and hummus\n\n-signed, a totally unbiased Tyrean\n\n---------------------\n\nI recommend Mazraani in the Old Souk for breakfast, just try to go early because most of the time they're closed by 10-11 (they open at like 3 in the morning though, if kabasak l jou3), if you can go to 'Al-Jamal' (weather allowing, of course), which is the beach near the cemeteries (the area that we call 'Al-Kharab'), you can have some great seafood, but what I really recommend is grabbing some sandwiches from Mahfouz in the Old Souk, best sandwiches you'll ever eat, be sure to order their renowned fateyel sandwich, just be ready to order a hell lot because their sandwiches are basically two-bite-sized, no place to sit, really, much less drink in, but it's close to lots of liquor stores and at the same time you'll be damned if you get to Tyre and don't eat at Mahfouz; now for dinner, two words: Le Phenicien, it's in the fishing port, and a fancy place (relative to Tyre), they have some amazing seafood dishes and you can pick your fish yourself, and they're in the Christian Quarter (which as a whole is a great place for food and drinking) and so they server alcohol.",
      "activityTypes": [
        "culture",
        "food",
        "nature"
      ],
      "popularity": 4,
      "url": "https://www.reddit.com/r/lebanon/comments/ane2d5/daughters_and_sons_of_south_of_lebanon/eftnx7y/"
    }
  ],
  "food": [
    {
      "type": "post",
      "author": "Princess_Yoloswag",
      "text": "I'll start. \n\n**NomNom Chicken** (Doura)\n\nKorean fried chicken place that only opened recently. Very tasty and authentic. Get the Spicy (=authentic), Soy Garlic, or mild version (if you can't handle spice). Kimchi is also great. Super nice people too.\n\n&amp;nbsp;\n\n**New Indo Lankan Restaurant** (Doura)\n\nI know the place is authentic because I've been there over a dozen times and have yet to encounter someone who's Lebanese that I didn't drag there myself. The place is small, not very inviting, smells of oil, and the waiter barely speaks English or Arabic. The food is also amazing, authentic and very flavorful. If you value ambience over food, stay away, but if you want proper South Asian cuisine, you are in the right spot. My western and more adventurous Lebanese friends love that place. \n\n(On a more personal note: I love having first dates there and seeing how she reacts. If she thinks it's hilarious and curious about the food, she's a keeper.)\n\n&amp;nbsp;\n\n**Alsah restaurant** (Furn el Chebek)  \nTiny place near Hawa Chicken. Probably my favorite place for authentic Lebanese food. All my Lebanese friends also confirm it's authenticity. If I feel like having Lebanese food, that's my #1 spot.",
      "activityTypes": [
        "culture",
        "food"
      ],
      "popularity": 13,
      "url": "https://www.reddit.com/r/lebanon/comments/1ixb9cf/favorite_hidden_gem_restaurants/"
    },
    {
      "type": "comment",
      "author": "mallydobb",
      "text": "I loved the Indo lanken restaurant, was a highlight of my visits to Dawra. I enjoyed how you could buy bags of the curry/sauces and take home. There was also an Armenian owned Filipino place, think it was off near big sale. When you entered it was like a café at the bottom and you went up a spiral staircase that took you right to the kitchen, the dining room just off from there. Amazing food. Jabbour’s was good for a change. I tried 𝘢𝘴𝘴𝘢𝘧𝘪𝘳 once, but never again. Texture wise it was something that I will never forget, and unless I ate it wrong the crunching of the bones was something that I heard and felt in my head for a solid week. Le chef was a treat when in the area.",
      "activityTypes": [
        "food"
      ],
      "popularity": 3,
      "url": "https://www.reddit.com/r/lebanon/comments/1ixb9cf/favorite_hidden_gem_restaurants/men126e/"
    },
    {
      "type": "comment",
      "author": "justwrongadvice",
      "text": "Will have to try Alsah \n\nMake it out to la creperie for Lebanese food and reserve a window seat.. really really nice place for a table",
      "activityTypes": [
        "food"
      ],
      "popularity": 2,
      "url": "https://www.reddit.com/r/lebanon/comments/1ixb9cf/favorite_hidden_gem_restaurants/mel5qho/"
    },
    {
      "type": "comment",
      "author": "Lbspirit",
      "text": "Places to try beirut:\n\n-ahwet 60 beirut recommend it \n- brio coffeeshop recommend it \n- cafe younis I like hamra branch \n- manara palace cafe recommend it \n- shatila cafe recommend it \n- on board bliss \n- malak al tawouk I recommend burgers \n- t-marbouta for lebanese cuisine \n- em nazih for lebanese cuisine \n- national museum \n-aub museum+tour in aub\n-usj museum \n- sursock palace \n- the art house \n- historical mosques of Beirut downtown\n- downtown beirut \n-zaytuna bay \n- mano shawarma burj Hammoud\n- a museum under a church in downtown\n- ɓarbar for sure recommended\n- sweets there's this called mufataka it's a beiruty traditional sweets gotta try it from a place called makary basta area\n- for sure the rawshe rock \n- bayrock on sunset just sit on the terrace amazing view \nAnd sure you can go out of beirut and explore places \n\nThese came to mind if I remembered more will let you know. And if you need anything don't hesitate really ask whatever you want. I live in beirut btw so if you need anything let me know.",
      "activityTypes": [
        "culture",
        "food",
        "nature"
      ],
      "popularity": 3,
      "url": "https://www.reddit.com/r/lebanon/comments/1p1f81r/im_visiting_soon_for_7_days_and_id_love/npqom8e/"
    },
    {
      "type": "comment",
      "author": "janeroe9",
      "text": "I would add to this list Jai in Clemenceau if you like Asian food. Also Salon Beirut in Clemeneau/Hamra either for brunch or on a Wednesday night for a Jazz night (a bit expensive). Levant coffeeshop in Gemmayze for some Arabic sweets with your coffee. Le Beirut or Mezyan in Hamra on a Thursday or Friday night for some loud Arabic music with good Lebanese food and arak. Beit Beirut museum in Sodeco for a tour down history lane. From the national museum walk to Badaro street and chill in any coffeeshop you like. \nAs for outside Beirut, Harissa is great choice. There is a trail called Darb el Qamar there that’s just lovely to hike.\nHave fun!\nRegarding the safety, it has been okay, yet no one knows when shit hits the fan.",
      "activityTypes": [
        "culture",
        "food",
        "nature"
      ],
      "popularity": 1,
      "url": "https://www.reddit.com/r/lebanon/comments/1p1f81r/im_visiting_soon_for_7_days_and_id_love/npsyxh0/"
    },
    {
      "type": "comment",
      "author": "Lbspirit",
      "text": "Hello, hope you're doing well. I wish you best on your visit. \n\nRegular day:\nCoffee 3-5$\nBreakfast depends what you wonna have. Like you can get your own stuff eat at home which would cost you like for 500g labne or 500g cheese around 3-8$ and bread for like 1-3$, but if you wonna have breakfast outside like from a bakery, mankushe, kaak, wraps, sandwiches is like 2-7$ depends what you order.\n\nFor lunch: \nDepends where you eat if in like a fancy dine in around 20-40+$ sure depends on what you order and how fancy the place is. If street food like shawarma it's like 7$, Falafel is like 3$, burgers 5-15$ \n\nSo it really depends where you go. And as for clubbing idk depends i guess.",
      "activityTypes": [
        "food",
        "entertainment"
      ],
      "popularity": 1,
      "url": "https://www.reddit.com/r/lebanon/comments/1p1f81r/im_visiting_soon_for_7_days_and_id_love/nqfd73v/"
    },
    {
      "type": "comment",
      "author": "phoolip",
      "text": "Ruins and old sites, must see baalbek. A little bit of a drive but well worth it. While there , u certainly want to visit zahlee, charming little town;  go have lunch at the Berdawni, restaurant Arabi.",
      "activityTypes": [
        "culture",
        "food"
      ],
      "popularity": 2,
      "url": "https://www.reddit.com/r/lebanon/comments/1p1f81r/im_visiting_soon_for_7_days_and_id_love/npr6jrx/"
    },
    {
      "type": "post",
      "author": "EreshkigalKish2",
      "text": "Description\n\nWeekend in Yammouneh, Lebanon’s Oldest Nature Reserve اليمّونة، أقدم محمية طبيعية بلبنان\n\nJuniper Scent عطر اللزّاب\n12\nLikes\n83\nViews\nSep 29\n2025\nHow to Spend a Weekend in Yammouneh\nEscape to Yammouneh, a hidden gem in Lebanon’s Bekaa. Start your morning with a traditional saj breakfast prepared by the warm locals, then head out to explore the breathtaking area , one of the world’s oldest protected areas, dating back to the Roman era. Wander through trails lined with majestic juniper trees , discover natural springs (there are nearly 80!), and visit the unique nursery that cultivates native plants and aromatic herbs.\n\nIn the heart of the village, don’t miss Our Lady of Yammouneh Church, a symbol of coexistence standing tall for centuries. By night, experience the magic of “Bayt el Arzal,” where you can sleep in a rustic wooden hut beneath thousand-year-old larch trees, under a sky lit with a million stars.\n\nWhether you’re into history, nature, or simply seeking peace, Yammouneh offers a weekend you’ll never forget.",
      "activityTypes": [
        "culture",
        "food",
        "nature"
      ],
      "popularity": 11,
      "url": "https://www.reddit.com/r/lebanon/comments/1ntodrm/weekend_in_yammouneh_lebanons_oldest_nature/"
    },
    {
      "type": "post",
      "author": "EreshkigalKish2",
      "text": "The MiM Museum - A Beirut Hidden Gem\n\nThe Titans Podcast\n32\nLikes\n1,072\nViews\nJul 19\n2024\n#Beirut\n\n\n#Business\n\n\n#Tech\n\n\nEver wondered how a successful entrepreneur spends their free time? In this exclusive interview, we meet Salim Eddé, the visionary entrepreneur behind the MIM Museum in Beirut, Lebanon.\n\n Mr. Edde's interests lie elsewhere entirely. Upon achieving financial independence and business success, he discovered a deep passion for minerals. \n\nEmbark on a guided tour through the museum's awe-inspiring collection of over 2,000 minerals, representing 450 unique species from 70 countries around the globe. Mr. Eddé himself will lead you on this journey, offering fascinating insights into the history and composition of these breathtaking natural wonders. If you're ever wondering what to do in #Beirut  the MiM Museum is one the sites you shouldn't miss. ",
      "activityTypes": [
        "culture",
        "food"
      ],
      "popularity": 12,
      "url": "https://www.reddit.com/r/lebanon/comments/1jrxj7m/the_mim_museum_a_beirut_hidden_gem/"
    },
    {
      "type": "post",
      "author": "HalfManHalfCornball",
      "text": "So I plan on staying for 7-10 days in July. I have a friend that lives there so I will be having a guide. I'm trying to get the best experience for my money. Not looking for high end expensive places, just Moderate prices.  But I also wanted to get some input on travel tips for a great experience.\n\n There are some specific information I'm looking for. Such as cell phone service with internet. I have an unlocked OnePlus6t. So I'm wondering if there is an option to purchase fast data service for a reasonable price temporarily. I'm also looking for a a decent place to stay. I read in a previous post not to pay in US dollars because you can get cheaper in the local currency. So what is a good website to reserve somewhere to stay that will be private, clean with decent stay. \n\nAnd most important, some great places to eat street food. Looking for the hidden gems only know by locals. Also places with a great views that I must see. \n\nThank\n you ahead of time for your input. Much appreciated!!",
      "activityTypes": [
        "food"
      ],
      "popularity": 13,
      "url": "https://www.reddit.com/r/lebanon/comments/nbxiih/hey_planning_on_a_visiting_broummanabeirut_from/"
    },
    {
      "type": "comment",
      "author": "Dependent_Storage184",
      "text": "There’s a Persian cup in Hamra (the owners are actually iranian/Iranian-Lebanese) and Mayrig in Ashrafieh which is Armenian, Filipino Très Marias restaurant and shop in Dawra, Beirut and prob others. I’m trying to name ones where owners are actually from the country since that’s when it’s more authentic\n\nI think there’s an empanada take out place, the owners are Venezuelan-Lebanese",
      "activityTypes": [
        "food"
      ],
      "popularity": 5,
      "url": "https://www.reddit.com/r/lebanon/comments/1i8b4yv/any_ethnic_restaurants_recommendation/m8s1olq/"
    },
    {
      "type": "comment",
      "author": "Princess_Yoloswag",
      "text": "First time I hear German and Italian food being called \"ethnic\" lol.\n\nI heard \"das Küche\" is decent for German food. I can't personally couch for it as I've haven't been there, but it sometimes gets recommended. If you're into Indian food I recommend \"New indo Lankan restaurant\" near Doura. You can tell it's authentic because you only see South Asians and foreigners there. The other \"more popular\" Indian restaurants are very toned down flavor wise to accommodate the local palette.",
      "activityTypes": [
        "food"
      ],
      "popularity": 3,
      "url": "https://www.reddit.com/r/lebanon/comments/1i8b4yv/any_ethnic_restaurants_recommendation/m8rz1he/"
    },
    {
      "type": "comment",
      "author": "[deleted]",
      "text": "I like cafe badaro",
      "activityTypes": [
        "food"
      ],
      "popularity": 6,
      "url": "https://www.reddit.com/r/lebanon/comments/16wuzin/recommendations_for_affordable_lebanese/k2zhwno/"
    },
    {
      "type": "comment",
      "author": "AbilityWaste3689",
      "text": "Bustan_koreancafe inst",
      "activityTypes": [
        "food"
      ],
      "popularity": 1,
      "url": "https://www.reddit.com/r/lebanon/comments/1eyjje2/plz_can_someone_recommend_me_of_any_good/ljffrxw/"
    },
    {
      "type": "comment",
      "author": "[deleted]",
      "text": "Maybe he’s taking out some of those Syrians you speak of… I can only imagine how many there are hence the cheap restaurant ;)",
      "activityTypes": [
        "food"
      ],
      "popularity": 3,
      "url": "https://www.reddit.com/r/lebanon/comments/16wuzin/recommendations_for_affordable_lebanese/k2z7goq/"
    },
    {
      "type": "post",
      "author": "moe535",
      "text": "Guys i will be spending a two week vacation with my family (wife and 1 year old kid) in Lebanon soon, i need some recommendations on places to go, tasty restaurants, nice hotels with a view. not looking for the typical sight seeing places since i am Lebanese. looking for the hidden gems. would appreciate the recommendations.",
      "activityTypes": [
        "food"
      ],
      "popularity": 9,
      "url": "https://www.reddit.com/r/lebanon/comments/cd0ybl/vacation/"
    },
    {
      "type": "comment",
      "author": "LebaneseVillanelle",
      "text": "Download the Zomato app. It’s great for finding new restaurants.",
      "activityTypes": [
        "food"
      ],
      "popularity": 8,
      "url": "https://www.reddit.com/r/lebanon/comments/cd0ybl/vacation/etqq65l/"
    },
    {
      "type": "comment",
      "author": "[deleted]",
      "text": "Beware of the Syrians, how do you beware of something that’s everywhere. It’s like saying beware of the oxygen. They are literally everywhere. As for a nice place to eat, cafe badaro",
      "activityTypes": [
        "food"
      ],
      "popularity": 1,
      "url": "https://www.reddit.com/r/lebanon/comments/16wuzin/recommendations_for_affordable_lebanese/k33pluz/"
    },
    {
      "type": "comment",
      "author": "Sr_nygma",
      "text": "Hey, here are a few tips about Beirut:\n\nA walk to the Downtown area, Nejme square, as well as Beirut souks is a good option.\n\nSouk el Akel (food market) is happening there (Beirut Souks) on Tuesdays and Thrisdays evenings, and there is the farmer's market (souk al tayyeb) on Saturday morning.\n\nMuseums are a safe bet too, try the Sursok Museum (free) and the MIM (Minerals Museum, with a minimal fee) in Beirut, and you can always check, the National Museum, Dar el Nimr, Sfeir-Selmer Gallery or Beit Beirut (depending on the exhibition and if it is open).\n\nFancy some Manouche (traditional breakfast pie), Look up the Lebanese Bakery (Achrafieh) - a cosy place that brings incredible twists to the dish.\n\nFeel like having affordable and delicious Lebanese Mezze in the city? Look for T-marbouta (Hamra) &amp; Em Nazih (Hamra or Saifi).\n\nPrefer something Armenian? Then look up Nour-Fine Armenian Cuisine  (Abdel Wahab)\n\nFor busy nightlife, try Mar Mikhael (Armenia Street) any night. Something more chill would be Badaro district.\n\nAnd finally, for the best Lebanese ice cream of your life look up Hanna Mitri (halwayat al salam) - not the fanciest shop, but don't let that fool you (closed on Sunday).\n\nHope you have a good time.",
      "activityTypes": [
        "culture",
        "food",
        "nature"
      ],
      "popularity": 6,
      "url": "https://www.reddit.com/r/lebanon/comments/d8dfr9/im_coming_to_explore_lebanon_this_week/f1blnxa/"
    },
    {
      "type": "comment",
      "author": "ShadiChastain",
      "text": "The only Lebanese resto in the area is Cafe Badaro. It's pretty chill but you can find much better options if you go to other areas.",
      "activityTypes": [
        "food"
      ],
      "popularity": 1,
      "url": "https://www.reddit.com/r/lebanon/comments/16wuzin/recommendations_for_affordable_lebanese/k34911j/"
    },
    {
      "type": "comment",
      "author": "TheKingOfRandom3",
      "text": "more of a cafe not a restaurant i went to recently called بn , small cute place, drank 2 cups of tea for around 600 k with a friend, they kinda close early as well, but the vibes were vibin.",
      "activityTypes": [
        "food"
      ],
      "popularity": 1,
      "url": "https://www.reddit.com/r/lebanon/comments/16wuzin/recommendations_for_affordable_lebanese/k3563lr/"
    },
    {
      "type": "comment",
      "author": "JWC221B",
      "text": "I recommend chouf area has great cedar forests and many tourist landmark.. please check  youtube will show you where to go exactly .. Maybe if still hot weather visit Naqoura beach most clean and calm in lebanon. \nIf you re into food you will enjoy the stay to the max.",
      "activityTypes": [
        "food",
        "nature",
        "entertainment"
      ],
      "popularity": 4,
      "url": "https://www.reddit.com/r/lebanon/comments/d8dfr9/im_coming_to_explore_lebanon_this_week/f19pkcj/"
    },
    {
      "type": "post",
      "author": "Kartuce",
      "text": "...where are the best places to eat AND drink (never the one without the other) for a full day (e.g. can be one suggestion for lunch place and another for dinner... akid eza fi shi ma7al 7elo not to miss, feel free to drop) ?\n\nAre there more or less hidden archeological gems (old churches, mosques, phoenician landmark from different eras) apart from the ones in Tyre and Sidon ?\n\nFeel free to add your personal recos or favourite things to do South or places to stay because : 1) I love good lebanese stories, 2) Your story might inspire me as my plan is pretty flexible",
      "activityTypes": [
        "culture",
        "food"
      ],
      "popularity": 24,
      "url": "https://www.reddit.com/r/lebanon/comments/ane2d5/daughters_and_sons_of_south_of_lebanon/"
    },
    {
      "type": "post",
      "author": "Sir-ElioKF",
      "text": "Hey All\n\nI'm looking for restaurant recommendations in Beirut or at most a 30-40 min drive away from Beirut for Valentine's day. Could be any cuisine, and a nice view is appreciated but not necessary. Most important thing is atmosphere, nothing too crowded or very loud, though it's valentines fa tabi3e shwayyet 3aj2a bas mish fo2 rason el 3alam. Budget is up to 100$ though of course i would appreciate something around the 60$ range. \n\nThanks\n\nEDIT: Need to specify we're a muslim couple, so no alcohol/pork please!",
      "activityTypes": [
        "food"
      ],
      "popularity": 4,
      "url": "https://www.reddit.com/r/lebanon/comments/19ans7d/valentines_day_restaurant_recommendations/"
    },
    {
      "type": "comment",
      "author": "NotValkyrie",
      "text": "the war Museum in Mleta and the Beaufort Castle (Chkif), the wazene river and restaurants around it are worth a visit (it's next to borders) i'm not sure if you'll find a high class place tho",
      "activityTypes": [
        "culture",
        "food"
      ],
      "popularity": 7,
      "url": "https://www.reddit.com/r/lebanon/comments/ane2d5/daughters_and_sons_of_south_of_lebanon/efsvlmr/"
    },
    {
      "type": "comment",
      "author": "[deleted]",
      "text": "Sour, definitely, unlike Saida, there's places to sit and drink in, and our seafood is second to none, same with our foul and hummus\n\n-signed, a totally unbiased Tyrean\n\n---------------------\n\nI recommend Mazraani in the Old Souk for breakfast, just try to go early because most of the time they're closed by 10-11 (they open at like 3 in the morning though, if kabasak l jou3), if you can go to 'Al-Jamal' (weather allowing, of course), which is the beach near the cemeteries (the area that we call 'Al-Kharab'), you can have some great seafood, but what I really recommend is grabbing some sandwiches from Mahfouz in the Old Souk, best sandwiches you'll ever eat, be sure to order their renowned fateyel sandwich, just be ready to order a hell lot because their sandwiches are basically two-bite-sized, no place to sit, really, much less drink in, but it's close to lots of liquor stores and at the same time you'll be damned if you get to Tyre and don't eat at Mahfouz; now for dinner, two words: Le Phenicien, it's in the fishing port, and a fancy place (relative to Tyre), they have some amazing seafood dishes and you can pick your fish yourself, and they're in the Christian Quarter (which as a whole is a great place for food and drinking) and so they server alcohol.",
      "activityTypes": [
        "culture",
        "food",
        "nature"
      ],
      "popularity": 4,
      "url": "https://www.reddit.com/r/lebanon/comments/ane2d5/daughters_and_sons_of_south_of_lebanon/eftnx7y/"
    },
    {
      "type": "comment",
      "author": "Alifad",
      "text": "Nice views that distance I'd recommend either Mounir or Fakhreddine in Brummana, great food as well.",
      "activityTypes": [
        "food"
      ],
      "popularity": 1,
      "url": "https://www.reddit.com/r/lebanon/comments/19ans7d/valentines_day_restaurant_recommendations/kimb9lc/"
    },
    {
      "type": "comment",
      "author": "becharaerizk",
      "text": "Jezzine waterfalls have a lot of restaurants and many are excellent so you can go there. Also there are stunning landscapes you can see there",
      "activityTypes": [
        "food"
      ],
      "popularity": 3,
      "url": "https://www.reddit.com/r/lebanon/comments/ane2d5/daughters_and_sons_of_south_of_lebanon/eft34kc/"
    },
    {
      "type": "comment",
      "author": "EDBTZ0323",
      "text": "Sur is fantastic. Try to spot the 500 year old communal oven and eat their bread. I can't quite remember where it is in the old city, but surely some friendly Tyrians would know. \n\nFor Saida, Tawlet is a great choice, in the old town overlooking the port. For more local, but equally delicious seafood try the row of seafood joints on the main road in front of Falafel Rami just outside the old town. Their seating is on the street and their kitchens are open for you to see, so just pick one with a clean kitchen and enjoy, they've always got the daily catch. \n\nAlso, I've heard Saida Rest House is good, but expensive. I've never eaten there, but the ambiance is lovely. Definitely a nice place to have a coffee, at least. ",
      "activityTypes": [
        "food"
      ],
      "popularity": 2,
      "url": "https://www.reddit.com/r/lebanon/comments/ane2d5/daughters_and_sons_of_south_of_lebanon/eftq35l/"
    }
  ],
  "other": [
    {
      "type": "comment",
      "author": "Princess_Yoloswag",
      "text": "Hahaha. Yeah I take the weird, unconventional spots with amazing food over posh places that are as much about ambience than food.",
      "activityTypes": [
        "other"
      ],
      "popularity": 2,
      "url": "https://www.reddit.com/r/lebanon/comments/1ixb9cf/favorite_hidden_gem_restaurants/meo7wpm/"
    },
    {
      "type": "comment",
      "author": "janeroe9",
      "text": "I would add Seza in Mar Mkhayel for good Armenian food!",
      "activityTypes": [
        "other"
      ],
      "popularity": 1,
      "url": "https://www.reddit.com/r/lebanon/comments/1p1f81r/im_visiting_soon_for_7_days_and_id_love/npt0xqa/"
    },
    {
      "type": "comment",
      "author": "Lbspirit",
      "text": "On average yeah, but it all depends where you go literally and what you have. How much of a foodie you are? But I think 50$ for food is decent and you'd be enjoying. But sure if you wonna try fancier places the budget goes up",
      "activityTypes": [
        "other"
      ],
      "popularity": 1,
      "url": "https://www.reddit.com/r/lebanon/comments/1p1f81r/im_visiting_soon_for_7_days_and_id_love/nqfnz7k/"
    },
    {
      "type": "post",
      "author": "Queen_Laybee",
      "text": "Hey! \nI’m currently planning my wedding and I would love to have it outdoors in a natural, green setting. I’m not looking for a traditional venue. I just want something simple and surrounded by nature, like a piece of land, garden, or open field with greenery where I could host both the ceremony and the wedding. (preferably in the north)\n\nI’d handle setup, decoration, catering, etc. myself, so all I really need is the green space with trees\n\nIf anyone knows of places, landowners, or hidden gems where this might be possible, I’d really appreciate your suggestions!\n\nThanks in advance 🌿💚\n",
      "activityTypes": [
        "other"
      ],
      "popularity": 7,
      "url": "https://www.reddit.com/r/lebanon/comments/1ntn8oe/any_hidden_gemsgreen_land_for_a_simple_outdoor/"
    },
    {
      "type": "comment",
      "author": "GeneralMichelAoun",
      "text": "First rule is don't buy or exchange anything at the airport, that includes any cell phone coverage; let your friend do everything (if you trust them). Buying a phone service is similar to how prepaid works in the west, basically you will be given different monthly data plans to choose from and you pick whatever is convenient for you. \n\nAirbnb is pretty legit when it comes to rentals, just make sure you are getting a good deal!! you can get find a fair listing for \\~50 dollars/day but honestly if you are going for a short period of time take advantage of the crisis and get something real nice. It will be worth the few extra bucks.. if you genuinely trust your friend, let them help you but stay in control of your money. I swear it will go a long way because there are 3 different types of markets in Lebanon and knowing the differences will help you get the best deals.\n\nCan't help you with places, I'll let other redditors guide you unless you can visit the northern mountains which I highly suggest you do. We have some very good views near Qadisha valley, Tannourine, Afqa, Kesrouane, Sannine, etc.. also if you choose to visit these mountain villages I recommend you stay at different estates up there because it's even cheaper than Beirut and often have much better views!!",
      "activityTypes": [
        "other"
      ],
      "popularity": 6,
      "url": "https://www.reddit.com/r/lebanon/comments/nbxiih/hey_planning_on_a_visiting_broummanabeirut_from/gy230xr/"
    },
    {
      "type": "comment",
      "author": "Over_Location647",
      "text": "I second on Jai. Amazing food there.",
      "activityTypes": [
        "other"
      ],
      "popularity": 2,
      "url": "https://www.reddit.com/r/lebanon/comments/1i8b4yv/any_ethnic_restaurants_recommendation/m8se8g0/"
    },
    {
      "type": "comment",
      "author": "Sunshineleb",
      "text": "I agree for Persian Cup its good  \nDas Kuche is a mix of sausages, baby back ribs, burgers - food is good\n\nJai: is one of my favourite places.  \nFor Italian there are a lot of places: Tavolina - Mario e mario - Tom &amp; Mutz - Bavaglino - wooden cellar\n\nPamai Chop in Badaro - west african food\n\nGet Grilled - Good Indian food",
      "activityTypes": [
        "other"
      ],
      "popularity": 1,
      "url": "https://www.reddit.com/r/lebanon/comments/1i8b4yv/any_ethnic_restaurants_recommendation/m8vzyqa/"
    },
    {
      "type": "comment",
      "author": "Hihihifriends",
      "text": "Supervega’s food is amazing!!!",
      "activityTypes": [
        "other"
      ],
      "popularity": 2,
      "url": "https://www.reddit.com/r/lebanon/comments/16wuzin/recommendations_for_affordable_lebanese/k2zjq2u/"
    },
    {
      "type": "post",
      "author": "revolution_baller",
      "text": "I will be in Lebanon for 10 days. Any recommendations for some hidden gems or unique activities?",
      "activityTypes": [
        "other"
      ],
      "popularity": 8,
      "url": "https://www.reddit.com/r/lebanon/comments/d8dfr9/im_coming_to_explore_lebanon_this_week/"
    },
    {
      "type": "comment",
      "author": "michelosta",
      "text": "I recommend balou3 bal3a, Zahle, ehden, the castle of dreams in bakhoun, laqlouq/akoura, yahchouch, Saghbine, seeing the oldest olive tree in the world (6000 years old) in bchaaleh, Jezzine/bkassine, and the Beaufort castle. It would take less than 10 days to do all of these, and they are all either unique or not very well known to tourists (compared to places like Beirut and baalbek and Byblos and sour). And you will have the time of your life",
      "activityTypes": [
        "other"
      ],
      "popularity": 5,
      "url": "https://www.reddit.com/r/lebanon/comments/d8dfr9/im_coming_to_explore_lebanon_this_week/f1a0itu/"
    },
    {
      "type": "comment",
      "author": "Isko_",
      "text": "for food try joseph (sin el fil) it has the best shawarma",
      "activityTypes": [
        "other"
      ],
      "popularity": 2,
      "url": "https://www.reddit.com/r/lebanon/comments/cd0ybl/vacation/etri8e7/"
    },
    {
      "type": "comment",
      "author": "MantiEnjoyer",
      "text": "Not korean but bamboo in jounieh has amazing food, it's menu is Chinese Indian and thai food, they also give you a 20% coupon for your birthday \n\nThere's also ramen ya in gemeyze which is Japanese and does ramen and katsu curry if you want that too",
      "activityTypes": [
        "other"
      ],
      "popularity": 5,
      "url": "https://www.reddit.com/r/lebanon/comments/177vpmq/restaurant_recommendations/k4voxa3/"
    },
    {
      "type": "comment",
      "author": "kifac",
      "text": "Went there twice last week. \n\nPlace is very very good. The staff are amazing and the food is unreal.",
      "activityTypes": [
        "other"
      ],
      "popularity": 3,
      "url": "https://www.reddit.com/r/lebanon/comments/177vpmq/restaurant_recommendations/k4vw3o8/"
    },
    {
      "type": "comment",
      "author": "MantiEnjoyer",
      "text": "It has, Chinese, Indian, and thai food, shu el sou2al ma f7emet",
      "activityTypes": [
        "other"
      ],
      "popularity": 1,
      "url": "https://www.reddit.com/r/lebanon/comments/177vpmq/restaurant_recommendations/k4xw5cy/"
    },
    {
      "type": "comment",
      "author": "CipherTheLight",
      "text": "Go to Jai near hamra in beirut. Its one of the best thai food places.",
      "activityTypes": [
        "other"
      ],
      "popularity": 6,
      "url": "https://www.reddit.com/r/lebanon/comments/177vpmq/restaurant_recommendations/k4vxeue/"
    },
    {
      "type": "comment",
      "author": "[deleted]",
      "text": "oooooh, i want to know too.\n\ni am thinking to take her again to PIERRE Y AMIGOS since she loved it on her birthday and told me she wants to go again one day, but it is in batorun so a bit far from u.\n\nand yes, the budget was $59 with drinks but i admit, we ordered more food than we needed.",
      "activityTypes": [
        "other"
      ],
      "popularity": 0,
      "url": "https://www.reddit.com/r/lebanon/comments/19ans7d/valentines_day_restaurant_recommendations/kim5mib/"
    },
    {
      "type": "comment",
      "author": "[deleted]",
      "text": "Tyr and only Tyr for food. ",
      "activityTypes": [
        "other"
      ],
      "popularity": 4,
      "url": "https://www.reddit.com/r/lebanon/comments/ane2d5/daughters_and_sons_of_south_of_lebanon/efsmqyl/"
    }
  ],
  "nature": [
    {
      "type": "post",
      "author": "MethodGlobal1994",
      "text": "\nLebanon has been always on my top list and honestly i can’t even imagine I’m going there soon. You guys are truly magical and you truly deserve all the best. Sorry if it’s long a little bit but I’m a freak when it comes to explore a new culture especially one that rich as yours. Im so sorry if this is too long and too much completely understandable \n\nThis is a overview of what i like \n\n\t•\tHistory &amp; old cities (ancient ruins, castles, mosques, old ports, alleys)\n\n\t•\tBeautiful nature escapes that are not too far\n\n\t•\tMountains and viewpoints\n\n\t•\tHidden gems / authentic neighborhoods\n\n\t•\tWalkable areas with culture and character\n\nMy limits\n\t•\tI’m staying in Beirut, and I’m only willing to \ngo up to 1 hour away.\n\n\t•\tThe only longer trip I’m doing is Byblos (I’m definitely going there — love the vibe).\n\nPlaces I’m considering\n\n\t•\tJeita Grotto (looks amazing — worth it?)\n\n\t•\tHarissa + Jounieh\n\n\t•\tBeirut historical areas / alleys\n\n\t•\tShouf or any mountain spots within 1 hour\n\n\n\n\tWhat are the absolute must-visit places for someone who loves history, nature, and hidden old streets, what’s the best food places that are authentic, any hidden gems you’d recommend \n\nWould appreciate any local tips, secret spots\n\nThank you guys \n",
      "activityTypes": [
        "culture",
        "nature"
      ],
      "popularity": 4,
      "url": "https://www.reddit.com/r/lebanon/comments/1p1f81r/im_visiting_soon_for_7_days_and_id_love/"
    },
    {
      "type": "comment",
      "author": "Lbspirit",
      "text": "Places to try beirut:\n\n-ahwet 60 beirut recommend it \n- brio coffeeshop recommend it \n- cafe younis I like hamra branch \n- manara palace cafe recommend it \n- shatila cafe recommend it \n- on board bliss \n- malak al tawouk I recommend burgers \n- t-marbouta for lebanese cuisine \n- em nazih for lebanese cuisine \n- national museum \n-aub museum+tour in aub\n-usj museum \n- sursock palace \n- the art house \n- historical mosques of Beirut downtown\n- downtown beirut \n-zaytuna bay \n- mano shawarma burj Hammoud\n- a museum under a church in downtown\n- ɓarbar for sure recommended\n- sweets there's this called mufataka it's a beiruty traditional sweets gotta try it from a place called makary basta area\n- for sure the rawshe rock \n- bayrock on sunset just sit on the terrace amazing view \nAnd sure you can go out of beirut and explore places \n\nThese came to mind if I remembered more will let you know. And if you need anything don't hesitate really ask whatever you want. I live in beirut btw so if you need anything let me know.",
      "activityTypes": [
        "culture",
        "food",
        "nature"
      ],
      "popularity": 3,
      "url": "https://www.reddit.com/r/lebanon/comments/1p1f81r/im_visiting_soon_for_7_days_and_id_love/npqom8e/"
    },
    {
      "type": "comment",
      "author": "janeroe9",
      "text": "I would add to this list Jai in Clemenceau if you like Asian food. Also Salon Beirut in Clemeneau/Hamra either for brunch or on a Wednesday night for a Jazz night (a bit expensive). Levant coffeeshop in Gemmayze for some Arabic sweets with your coffee. Le Beirut or Mezyan in Hamra on a Thursday or Friday night for some loud Arabic music with good Lebanese food and arak. Beit Beirut museum in Sodeco for a tour down history lane. From the national museum walk to Badaro street and chill in any coffeeshop you like. \nAs for outside Beirut, Harissa is great choice. There is a trail called Darb el Qamar there that’s just lovely to hike.\nHave fun!\nRegarding the safety, it has been okay, yet no one knows when shit hits the fan.",
      "activityTypes": [
        "culture",
        "food",
        "nature"
      ],
      "popularity": 1,
      "url": "https://www.reddit.com/r/lebanon/comments/1p1f81r/im_visiting_soon_for_7_days_and_id_love/npsyxh0/"
    },
    {
      "type": "post",
      "author": "EreshkigalKish2",
      "text": "Description\n\nWeekend in Yammouneh, Lebanon’s Oldest Nature Reserve اليمّونة، أقدم محمية طبيعية بلبنان\n\nJuniper Scent عطر اللزّاب\n12\nLikes\n83\nViews\nSep 29\n2025\nHow to Spend a Weekend in Yammouneh\nEscape to Yammouneh, a hidden gem in Lebanon’s Bekaa. Start your morning with a traditional saj breakfast prepared by the warm locals, then head out to explore the breathtaking area , one of the world’s oldest protected areas, dating back to the Roman era. Wander through trails lined with majestic juniper trees , discover natural springs (there are nearly 80!), and visit the unique nursery that cultivates native plants and aromatic herbs.\n\nIn the heart of the village, don’t miss Our Lady of Yammouneh Church, a symbol of coexistence standing tall for centuries. By night, experience the magic of “Bayt el Arzal,” where you can sleep in a rustic wooden hut beneath thousand-year-old larch trees, under a sky lit with a million stars.\n\nWhether you’re into history, nature, or simply seeking peace, Yammouneh offers a weekend you’ll never forget.",
      "activityTypes": [
        "culture",
        "food",
        "nature"
      ],
      "popularity": 11,
      "url": "https://www.reddit.com/r/lebanon/comments/1ntodrm/weekend_in_yammouneh_lebanons_oldest_nature/"
    },
    {
      "type": "comment",
      "author": "Sr_nygma",
      "text": "Sidenote here: since you are considering such a relatively long stay for our small county, you could relatively fit in 3-4 day trips and cover the entirety of the country during your stay, might i suggest:\n\n- a day at the beach north + visiting batrun and byblos ancient cities\n-a day at beit al din, deir al quamar, and the chouf reserve (could be also done in 1/2 a day)\n-a day in beqaa for the roman ruins in baalbek (can also become 1/2 a day if you leave early)\n-a day down in tyr with beach, historic city and all\n-if you're in for a long day (leave early, come back late, anda 2.5 hour drive each way) or an overnight you can also cover ehden and the cedar of god reserve",
      "activityTypes": [
        "culture",
        "nature"
      ],
      "popularity": 5,
      "url": "https://www.reddit.com/r/lebanon/comments/nbxiih/hey_planning_on_a_visiting_broummanabeirut_from/gy2qnyl/"
    },
    {
      "type": "comment",
      "author": "Sr_nygma",
      "text": "Hey, here are a few tips about Beirut:\n\nA walk to the Downtown area, Nejme square, as well as Beirut souks is a good option.\n\nSouk el Akel (food market) is happening there (Beirut Souks) on Tuesdays and Thrisdays evenings, and there is the farmer's market (souk al tayyeb) on Saturday morning.\n\nMuseums are a safe bet too, try the Sursok Museum (free) and the MIM (Minerals Museum, with a minimal fee) in Beirut, and you can always check, the National Museum, Dar el Nimr, Sfeir-Selmer Gallery or Beit Beirut (depending on the exhibition and if it is open).\n\nFancy some Manouche (traditional breakfast pie), Look up the Lebanese Bakery (Achrafieh) - a cosy place that brings incredible twists to the dish.\n\nFeel like having affordable and delicious Lebanese Mezze in the city? Look for T-marbouta (Hamra) &amp; Em Nazih (Hamra or Saifi).\n\nPrefer something Armenian? Then look up Nour-Fine Armenian Cuisine  (Abdel Wahab)\n\nFor busy nightlife, try Mar Mikhael (Armenia Street) any night. Something more chill would be Badaro district.\n\nAnd finally, for the best Lebanese ice cream of your life look up Hanna Mitri (halwayat al salam) - not the fanciest shop, but don't let that fool you (closed on Sunday).\n\nHope you have a good time.",
      "activityTypes": [
        "culture",
        "food",
        "nature"
      ],
      "popularity": 6,
      "url": "https://www.reddit.com/r/lebanon/comments/d8dfr9/im_coming_to_explore_lebanon_this_week/f1blnxa/"
    },
    {
      "type": "comment",
      "author": "JWC221B",
      "text": "I recommend chouf area has great cedar forests and many tourist landmark.. please check  youtube will show you where to go exactly .. Maybe if still hot weather visit Naqoura beach most clean and calm in lebanon. \nIf you re into food you will enjoy the stay to the max.",
      "activityTypes": [
        "food",
        "nature",
        "entertainment"
      ],
      "popularity": 4,
      "url": "https://www.reddit.com/r/lebanon/comments/d8dfr9/im_coming_to_explore_lebanon_this_week/f19pkcj/"
    },
    {
      "type": "comment",
      "author": "khmt98",
      "text": "Go to Tyre beach area it's stunning",
      "activityTypes": [
        "nature"
      ],
      "popularity": 1,
      "url": "https://www.reddit.com/r/lebanon/comments/d8dfr9/im_coming_to_explore_lebanon_this_week/f1ax4w6/"
    },
    {
      "type": "comment",
      "author": "[deleted]",
      "text": "You gotta try le Phenicien in Tyre for seafood. Its epic! Other than Saida and Tyre, there are : the Jezzine waterfalls, Naqoura beach (check Tyros resort) and the sea wall, mo3taqal al khiyam (old detention camp) &amp; Fatima Gate to see the borders with Palestine.",
      "activityTypes": [
        "nature"
      ],
      "popularity": 16,
      "url": "https://www.reddit.com/r/lebanon/comments/ane2d5/daughters_and_sons_of_south_of_lebanon/efsmg1j/"
    },
    {
      "type": "comment",
      "author": "[deleted]",
      "text": "Sour, definitely, unlike Saida, there's places to sit and drink in, and our seafood is second to none, same with our foul and hummus\n\n-signed, a totally unbiased Tyrean\n\n---------------------\n\nI recommend Mazraani in the Old Souk for breakfast, just try to go early because most of the time they're closed by 10-11 (they open at like 3 in the morning though, if kabasak l jou3), if you can go to 'Al-Jamal' (weather allowing, of course), which is the beach near the cemeteries (the area that we call 'Al-Kharab'), you can have some great seafood, but what I really recommend is grabbing some sandwiches from Mahfouz in the Old Souk, best sandwiches you'll ever eat, be sure to order their renowned fateyel sandwich, just be ready to order a hell lot because their sandwiches are basically two-bite-sized, no place to sit, really, much less drink in, but it's close to lots of liquor stores and at the same time you'll be damned if you get to Tyre and don't eat at Mahfouz; now for dinner, two words: Le Phenicien, it's in the fishing port, and a fancy place (relative to Tyre), they have some amazing seafood dishes and you can pick your fish yourself, and they're in the Christian Quarter (which as a whole is a great place for food and drinking) and so they server alcohol.",
      "activityTypes": [
        "culture",
        "food",
        "nature"
      ],
      "popularity": 4,
      "url": "https://www.reddit.com/r/lebanon/comments/ane2d5/daughters_and_sons_of_south_of_lebanon/eftnx7y/"
    }
  ],
  "entertainment": [
    {
      "type": "comment",
      "author": "Lbspirit",
      "text": "Hello, hope you're doing well. I wish you best on your visit. \n\nRegular day:\nCoffee 3-5$\nBreakfast depends what you wonna have. Like you can get your own stuff eat at home which would cost you like for 500g labne or 500g cheese around 3-8$ and bread for like 1-3$, but if you wonna have breakfast outside like from a bakery, mankushe, kaak, wraps, sandwiches is like 2-7$ depends what you order.\n\nFor lunch: \nDepends where you eat if in like a fancy dine in around 20-40+$ sure depends on what you order and how fancy the place is. If street food like shawarma it's like 7$, Falafel is like 3$, burgers 5-15$ \n\nSo it really depends where you go. And as for clubbing idk depends i guess.",
      "activityTypes": [
        "food",
        "entertainment"
      ],
      "popularity": 1,
      "url": "https://www.reddit.com/r/lebanon/comments/1p1f81r/im_visiting_soon_for_7_days_and_id_love/nqfd73v/"
    },
    {
      "type": "post",
      "author": "yarasam",
      "text": "I'll be traveling through Lebanon for a few weeks and want to visit sites that aren't so popular. I know there are plenty of beautiful parks, waterfalls, etc. Any tips are helpful (and please post pictures!)",
      "activityTypes": [
        "entertainment"
      ],
      "popularity": 2,
      "url": "https://www.reddit.com/r/lebanon/comments/db2rao/looking_for_hidden_gems_lebanon/"
    },
    {
      "type": "comment",
      "author": "Perito",
      "text": "Hello, \n\nFirst of all check [this post, it has a lot of recommendations!](/r/lebanon/comments/asl5wd/places_to_visit_and_food_to_try_for_tourists_in/)\n\n1 - For things to do: Check http://www.footprintsclub.com/ and http://www.lebtivity.com/\n\n2- Check [LiveLoveBeirut](https://www.instagram.com/livelovebeirut/?hl=en), and [LiveLoveLebanon](http://livelovelebanon.com/en) and it's [facebook](https://www.facebook.com/LiveLoveLebanon/)\n\n3- For food check [NoGarlicNoOnions](http://www.nogarlicnoonions.com/) and [it's Instagram page](https://www.instagram.com/nogarlicnoonions/?hl=en)",
      "activityTypes": [
        "entertainment"
      ],
      "popularity": 5,
      "url": "https://www.reddit.com/r/lebanon/comments/cd0ybl/vacation/etqopaz/"
    },
    {
      "type": "comment",
      "author": "JWC221B",
      "text": "I recommend chouf area has great cedar forests and many tourist landmark.. please check  youtube will show you where to go exactly .. Maybe if still hot weather visit Naqoura beach most clean and calm in lebanon. \nIf you re into food you will enjoy the stay to the max.",
      "activityTypes": [
        "food",
        "nature",
        "entertainment"
      ],
      "popularity": 4,
      "url": "https://www.reddit.com/r/lebanon/comments/d8dfr9/im_coming_to_explore_lebanon_this_week/f19pkcj/"
    },
    {
      "type": "post",
      "author": "jotaro_sed",
      "text": "This might not be the best time to ask this and im sorry if youre upset abt recent events, but ive been really craving asian food recently and ive been wondering if anyone know a place that serves good korean bbq.",
      "activityTypes": [
        "entertainment"
      ],
      "popularity": 3,
      "url": "https://www.reddit.com/r/lebanon/comments/177vpmq/restaurant_recommendations/"
    }
  ]
}